project/atropos-go/etcd_concurrent_read-master/master/k150k_cancel/output/with_expensive_read/cheap_write.log
 0 / 180 B                                                                                                                                         !   0.00%INFO: 2023/06/12 13:57:38 ccResolverWrapper: sending new addresses to cc: [{localhost:2379 0  <nil>}]
INFO: 2023/06/12 13:57:38 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
INFO: 2023/06/12 13:57:38 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
 180 / 180 Boooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 8s

Summary:
  Total:	8.9655 secs.
  Slowest:	0.0629 secs.
  Fastest:	0.0003 secs.
  Average:	0.0031 secs.
  Stddev:	0.0104 secs.
  Requests/sec:	20.0769

Response time histogram:
  0.0003 [1]	|
  0.0065 [169]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.0128 [1]	|
  0.0191 [0]	|
  0.0253 [0]	|
  0.0316 [0]	|
  0.0379 [0]	|
  0.0441 [2]	|
  0.0504 [5]	|∎
  0.0567 [1]	|
  0.0629 [1]	|

Latency distribution:
  10% in 0.0003 secs.
  25% in 0.0004 secs.
  50% in 0.0005 secs.
  75% in 0.0006 secs.
  90% in 0.0030 secs.
  95% in 0.0420 secs.
  99% in 0.0629 secs.