project/atropos-go/etcd_concurrent_read-master/master/k150k_cancel/output/with_expensive_read/expensive_read.log
bench with linearizable range
 0 / 11 B                                                                                                                                          !   0.00%INFO: 2023/06/12 13:57:38 ccResolverWrapper: sending new addresses to cc: [{localhost:2379 0  <nil>}]
INFO: 2023/06/12 13:57:38 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
INFO: 2023/06/12 13:57:38 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
 11 / 11 Booooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 10s

Summary:
  Total:	10.1568 secs.
  Slowest:	0.1560 secs.
  Fastest:	0.1229 secs.
  Average:	0.1400 secs.
  Stddev:	0.0098 secs.
  Requests/sec:	1.0830

Response time histogram:
  0.1229 [1]	|∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.1263 [1]	|∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.1296 [0]	|
  0.1329 [0]	|
  0.1362 [0]	|
  0.1395 [3]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.1428 [2]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.1461 [1]	|∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.1494 [0]	|
  0.1527 [2]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.1560 [1]	|∎∎∎∎∎∎∎∎∎∎∎∎∎

Latency distribution:
  10% in 0.1365 secs.
  25% in 0.1385 secs.
  50% in 0.1421 secs.
  75% in 0.1501 secs.
  90% in 0.1560 secs.